import React from 'react';
import LessonInfo from './LessonInfo.jsx';

const LessonsBox = () => {
  const width = { width: '15rem' };
  return (
    <>
      <div className="d-flex justify-content-center align-items-center min-vw-100 min-vh-100">
        <div className="d-flex flex-column justify-content-around pt-5">
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={1} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={2} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={3} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={4} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={5} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={6} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={7} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={8} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={9} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={10} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={11} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={12} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={13} />
          <LessonInfo width={width} title="Урок-знакомство" description="Перед тем, как будем нырять за сокровищами, придумывать идеи и рисовать персонажей, хочу рассказать вам немного про стиль и его составляющие" number={14} />

        </div>
      </div>

    </>
  );
};
export default LessonsBox;
